Enterprise_Serivces/Prod/Bronze3/LoyaltyMerchandisingService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05/ILoyaltyMerchandisingService/GetMerchandisedProducts</wsa:Action><wsa:MessageID>uuid:35d34949-ffe7-4f8e-9b04-b6aa31d59140</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslloyaltyprogramservicesqa1.testgs.pvt/LoyaltyMerchandisingService.svc</wsa:To></soap:Header><soap:Body><GetMerchandisedProducts xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><NumberOfItemsPerPage xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">100</NumberOfItemsPerPage><PageNumber xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">1</PageNumber></request></GetMerchandisedProducts></soap:Body></soap:Envelope>